In [144]:
import pandas as pd

In [145]:
url='https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'
df= pd.read_csv(url)

In [146]:
df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [147]:
df.columns = [e.lower().replace(' ', '_') for e in df.columns]
# primero formatamos las columnas para eliminar los espacios y en minuscula para que sea mas facil gestionar df

In [148]:
df.rename(columns={'st': 'state'},inplace=True)

In [149]:
df.isna().sum()
# encontramos la constante de los numeros de 2937

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [150]:
df= df.dropna(how='all', axis=0) # matamos todos los NaN, para que sea mas faciles de trabajar y machacamos la variable para poder llamar a la tabla

In [151]:
df.state.value_counts() # imprimiendo todas las variables de las filas vemos que WA y AZ resaltan, quitando datos de Oregon y de Arizona.

state
Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: count, dtype: int64

In [152]:
fix_state = {'AZ':'Arizona', 'WA':'Washington'}

df.state = df.state.apply(lambda x: fix_state.get(x,x))

In [153]:
df.state.unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', 'Cali'],
      dtype=object)

In [154]:
arreglar_genero={'Femal':'F','Male':'M','female':'F'}
df.gender=df.gender.apply(lambda x:arreglar_genero.get(x,x))

In [155]:
df.gender.unique()

array([nan, 'F', 'M'], dtype=object)

In [156]:
df.state.value_counts()

state
Oregon        320
Arizona       211
California    211
Cali          120
Washington    111
Nevada         98
Name: count, dtype: int64

In [157]:
df.head() #aqui el formato limpio

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [158]:
arreglar_bachelor={'Bachelors':'Bachelor'}
df.education=df.education.apply(lambda x:arreglar_bachelor.get(x,x))

In [159]:
arreglar_car={'Sports Car':'Luxury','Luxury SUV':'Luxury', 'Luxury Car':'Luxury'}
df.vehicle_class=df.vehicle_class.apply(lambda x:arreglar_car.get(x,x))

In [160]:

df.customer_lifetime_value=df.customer_lifetime_value.apply(lambda x:x.replace('%','')if type (x)==str else x)

In [161]:
df.customer_lifetime_value=df.customer_lifetime_value.apply(lambda x: float(x)if type (x)==str else x)

In [162]:
df.customer_lifetime_value.unique() # con la funcion previa transformamos los strings en floats, al no tener caracteres especiales no nos da error. Sin embargo cualquier caracter especial hara reventar la funcion

array([       nan,  697953.59, 1288743.17, ..., 2031499.76,  323912.47,
        899704.02])

In [163]:
#Recordatorio que los NaN son FLOATS

In [164]:
df.vehicle_class.unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury'], dtype=object)

In [165]:
df.number_of_open_complaints.unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00'],
      dtype=object)

In [166]:
split_data = df.number_of_open_complaints.str.split('/')
df.number_of_open_complaints = split_data.apply(lambda x: x[1] if type(x)==list else x)

In [167]:
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323

In [174]:
df.gender=df.gender.fillna(df.gender.mode()[0])
df.gender.mode()

0    F
Name: gender, dtype: object

In [169]:
df.customer_lifetime_value=df.customer_lifetime_value.fillna(df.customer_lifetime_value.mode()[0])

In [173]:
df.customer_lifetime_value.describe()

count    1.071000e+03
mean     7.921714e+05
std      6.432150e+05
min      2.004351e+05
25%      4.019753e+05
50%      5.849322e+05
75%      8.945210e+05
max      5.816655e+06
Name: customer_lifetime_value, dtype: float64

In [ ]:
# ahora podemos calcular los problemas de

In [179]:
df.gender.describe()

count     1071
unique       2
top          F
freq       619
Name: gender, dtype: object